[
  {
    "character": "Johan Liebert",
    "not_e8_arguments": [
      "Johan does not fear vulnerability or being controlled — he deliberately makes himself vulnerable and manipulates others through *passivity*, not dominance.",
      "He is emotionally detached and nihilistic rather than protectively intense; his influence is rooted in psychological suggestion, not assertive will.",
      "His core drive is existential annihilation and observation of human depravity, not control over territory or justice-seeking motives typical of e8s."
    ]
  },
  {
    "character": "Misato Katsuragi",
    "not_e8_arguments": [
      "Misato’s assertiveness is reactive and compensatory, masking emotional instability and unresolved trauma, rather than stemming from a foundational fear of vulnerability.",
      "She does not seek to control others or her environment — she often avoids confrontation with authority and represses her emotional needs.",
      "Her self-destructive tendencies and emotional bonding patterns are more aligned with a e2 or e3 dynamic than the directness and grounded presence of an e8."
    ]
  },
  {
    "character": "Satoru Gojo",
    "not_e8_arguments": [
      "Gojo’s power is effortless and unchallenged, but he uses it flippantly; he lacks the territorial defensiveness and grounded intensity that define e8s.",
      "His emotional immaturity, avoidance of responsibility, and reliance on charm and spectacle point toward a e7-ish or e3-ish orientation.",
      "He does not fear vulnerability — he’s often reckless with himself and others, prioritizing ideals and novelty over protection or control."
    ]
  },
  {
    "character": "Light Yagami",
    "not_e8_arguments": [
      "Light’s desire is not to protect or defend — it’s to create an ideal world in which *he* is morally superior and worshipped, which reflects e1 dynamics more than e8.",
      "He is calculating and perfectionist, suppressing emotion and planning meticulously — traits more typical of a e1 or e7 than an impulsive, instinctive e8.",
      "His fear is not of vulnerability but of moral impurity, powerlessness, or being judged — he seeks control through ideology, not gut-driven dominance."
    ]
  },
  {
    "character": "L (Lawliet)",
    "not_e8_arguments": [
      "L operates through detached analysis and intellectual gamesmanship, not instinctual assertiveness; his focus is on solving puzzles, not exerting dominance.",
      "He avoids direct confrontation, preferring anonymity and indirect control — a stark contrast to e8’s confrontational, territory-protecting nature.",
      "His core fear revolves around failure to outthink opponents, not vulnerability or loss of autonomy, aligning more with e5 or e6 motivations."
    ]
  },
  {
    "character": "Shinji Ikari",
    "not_e8_arguments": [
      "Shinji’s passivity and self-doubt contradict e8’s assertive, self-assured demeanor; he retreats from conflict rather than dominating it.",
      "His actions stem from a fear of rejection and a need for external validation, not a desire to protect or control his environment.",
      "He internalizes stress and avoids responsibility, contrasting e8’s tendency to externalize frustration and take charge impulsively."
    ]
  },
  {
    "character": "Shigeo Kageyama (Mob)",
    "not_e8_arguments": [
      "Mob suppresses his power to avoid harm and prioritize emotional harmony, rejecting the e8’s instinct to assert dominance or defend territory.",
      "His growth revolves around self-acceptance and emotional balance, not exercising control — a core e8 preoccupation.",
      "He fears losing his humanity through unchecked power, reflecting e9’s fear of disconnection, rather than e8’s fear of vulnerability."
    ]
  },
  {
    "character": "Rei Ayanami",
    "not_e8_arguments": [
      "Rei’s emotional detachment and compliance with authority oppose e8’s rebelliousness and need for autonomy.",
      "She lacks self-interest or a desire to influence others, functioning as a tool rather than asserting her will — antithetical to e8’s assertive core.",
      "Her existential emptiness and absence of personal drives align with e9 or e5, not e8’s intensity and lust for life."
    ]
  },
  {
    "character": "Levi Ackerman",
    "not_e8_arguments": [
      "Levi prioritizes survival and tactical efficiency over territorial control or dominance, aligning more with e6’s focus on security.",
      "His meticulous discipline and aversion to chaos contrast with e8’s impulsive, instinct-driven behavior.",
      "His loyalty to comrades and suppressed emotionality stem from trauma, not e8’s fear of vulnerability or need for autonomy."
    ]
  },
  {
    "character": "Lelouch vi Britannia",
    "not_e8_arguments": [
      "Lelouch’s power lies in strategic manipulation and intellect, not raw assertiveness; his goals are ideological, not rooted in protecting territory.",
      "He avoids direct confrontation unless forced, preferring subterfuge — a stark contrast to e8’s confrontational boldness.",
      "His core drive is revenge and creating a world for his sister, reflecting e3’s image-focused ambition or e4’s desire for significance, not e8’s lust for autonomy."
    ]
  },
  {
    "character": "Edward Elric",
    "not_e8_arguments": [
      "Edward’s anger is reactive to personal guilt and loss, not a protective instinct; his focus is restoration, not control — traits closer to e1 or e6.",
      "He values truth and knowledge over dominance, often questioning his own motives — introspective tendencies atypical of e8s.",
      "His fear of powerlessness stems from failure to protect loved ones, not e8’s fear of vulnerability or being controlled."
    ]
  },
  {
    "character": "Asuka Langley Soryu",
    "not_e8_arguments": [
      "Asuka’s aggression masks a deep fear of inadequacy and need for validation, aligning with e3’s image-consciousness rather than e8’s fearlessness.",
      "She is emotionally volatile and dependent on external praise, contrasting e8’s self-assured, grounded intensity.",
      "Her confrontational behavior is compensatory, not an expression of innate dominance or territoriality."
    ]
  },
  {
    "character": "Itachi Uchiha",
    "not_e8_arguments": [
      "Itachi’s actions are driven by self-sacrifice and duty, not a desire for control; his secrecy and solitude reflect e5 or e1 motivations.",
      "He avoids direct conflict unless necessary, preferring psychological manipulation — antithetical to e8’s confrontational style.",
      "His core fear revolves around failing to protect his brother, not e8’s fear of vulnerability or loss of autonomy."
    ]
  },
  {
    "character": "Vegeta",
    "not_e8_arguments": [
      "Vegeta’s pride and obsession with surpassing others stem from e3’s need for achievement, not e8’s focus on autonomy or justice.",
      "He masks vulnerability with arrogance, whereas e8s openly confront threats without pretense.",
      "His later loyalty to Earth is born of ego integration, not e8’s inherent drive to protect territory or assert dominance."
    ]
  }
]