{
    "Extraverted Thinking (ET)": {
        "dichotomies": ["Rational", "Logical", "Extraverted"],
        "themes": ["performance", "profit", "business"],
        "brief_description": "Is fed from objective data—facts and borrowed ideas. Depends upon the facts of experience and regards the abstract idea as unsubstantial and of negligible importance. Relies on facts outside of the thinker, which are more decisive than the thinking itself, for soundness and value. Has as its goal the solution of practical problems, discovery and classification of facts, criticism, and modification of generally accepted ideas, planning of programs, and developing formulas. Dwells upon the details of the concrete case, including irrelevancies. Has a tendency to multiply facts until their meaning is smothered and thinking is paralyzed. Consists of a succession of concrete representations that set in motion not so much by an inner thought activity as by the changing stream of sense perceptions. Extraverted Thinking (ET) uses explicit logic, including standardized methods, measurements, policies, and procedures, to make systems and operations more rational, efficient, or effective. This often involves working as part of an institution, be it corporate, scientific, academic, etc. Outwardly, Te delivers opinions and directives in a firm, direct, measured, and unemotional fashion. It may at times be perceived as harsh, tactless, or unsympathetic.",
        "detailed_description": "The extravert of thinking type is guided by the structures and laws of thought, as these have been taught to him by his educator. He is able to make good use of these forms as arguments, and in his actions. Every sensuous experience is at once fitteed into its appropriate perceptual complex, and to a person of this type it would seem impossible that there could be awareness of the world apart from systematized conceptions. Facts are only thinkable for him as parts of an organized reality. Insight cannot even be regarded simply as intuitive experience, but must have its place in some systematic context. This way of thinking appears to the extraverted thinker as such a natural necessity that it is apt to be taken as absolute.The objectivity of knowledge finds here its main support in facts and authorities. The system according to which the extraverted thinker arranges his facts is also held to be objective, although it is accepted as based on the prevailing authoritative views, and is subjected to no critical examination from within.He orders his facts critically and with great care, and herein lies the strength of the individual of this type. On the other hand, his chosen system may be a weak point, since it is often accepted as unquestionable, without the person concerned being himself aware of this. In this ordering of ideas and judgements this fanger may be greater than where facts of sensory perception are concerned, because in the former case there are more likely to be all kinds of subjective and capricious elements in the material itself. There is no doubt that thought can do creative work in its establishment and classification of facts and judgements. In general, one may say, therefore, that this type possesses great receptivity for facts and opinions, but that the formulaes by which he tests these, and according to which he classifies them, are frequently somewhat rigid and limited. It depends also on circumstances, whether the rigid or the receptive side prevails in the development of the type.It is possible, even in children of this character, to observe these two sides. They are accessible to anything which their thoughts can classify, and are quick to adobt current systems and in being able to apply them. In addition, they also make use of their knowledge at an early age, so as themselves to be regarded as authorities, setting themselves up, wiht a certain pedantic precociousness, as superior to others. In later life, also, these peculiarities are found in alll kinds of variations in people of this type. Their knowledge usually embraces a wide field, and they are rarely unwilling to add something fresh to it. But there must e no interference with the system or with the principles to which they subscribe, and which for them possess absolute validity. Any such attempt is repulsed as foolish, morbid, or mischevious. Convinced of their objectivity, they strongly oppose anyone who would be prepared to consider the validity of other modes of classification or other principles. The advantages of their strong side, and the disadvantages of their weak points, are also frequently evident in another field. The official, doing useful work in all kinds of social conditions by the application of tiresome legal stipulations, may at home allow his rigid principles and his niggling exactitude to destroy all happiness. in his family, exerting an inhibiting influence on th edevelopment of his children. The advantage of a clear and business-like outlook may, when it is applied in petty ways, degenerate into a tiresome and dreary prosiness. Controlling principles and systems then become strait-jackets. Right and wrong, good and bad, are judged by this thinking type of person according to whether they conform to his system or not. this has for him absolute validity: it is the purest expression of the law of the universe. This is true for his scientific as for his ethical system. Anything that does not agree therewith appears to hima ccidental or untrue. He is convinced that such facts will, on closer examination, fit into his system, and that anything in his nature which he will ultimately br able to master.If the standpoint by such people is a broad minded one, they may exert a settling and purifying influence, both where it is a matter of profitting by experience and where controlling principles are involved.Among peoples of this type are found excellent officials, organizers, and scientists, people who distinguish themselves, both in practical and theoretical fields, by their thoroughness and their wide knowledge. Few women belong to this type. These people are always most effective in the external aspect of their sphere of influence, aince their adjustment is mainy in an outward direction. Here their aptness for system introducesa new clarity and vision. Where things are already in order, their efforts are limited to the maintenance of the status quo and to the resistance against disturbing influences. Hence in a narrower sphere they are liable to be somewhat conservative and conventional. In such circumstances they may appear to be quiet, pleasant people; but at the same time somewhat rigid and tyranntical, without much understanding of other's needs.As far as activity is concerned, there is evident in these people a manifestation which we shall also have occasion to notice in intoverted thinkers and in feeling types, namely, the significant place assumed by the will. I agree with Jung in regarding to the will as an expression of consciously organizes aspirations. In thinking and feeling there is a definite extension of the conscious mental organization. As a result, instinctual and impulsive forces are canalized in the personality, increading the amount of free energy which is more or less constantly available. In instinctive and intuitive people, unconscious impulse and spontaneous inspiration play the most important part in stimulating activity. In people of thought and feeling, the will is the more constantly essential factor. The consequence is that, in general, thinking types manifest a constant, quiet activity. In addition to their feeling for order and their conscientiousness, their persistence is a particularly advantageous quality. Their contact with material things, and with theories and systems, is, however, usually better than it is with people. Their disinclination for introspection often prevents their entering very deeply into psychological problems. These reasoning people manifest, also, in general, a certain coldness and aloofness, their systematized thinking standing between themselves and the world. Even in extraverted thinkers this is noticeable in their attitude and approach, in spite of their satisfactory adaptation to circumstances.Both the instinctive and intuitive aspets of the disposition may assert themselves in thinking-types of this kind, and be subjected to the influence of reason. Reason tends to emphasize the sensory aspect of instinctual experience. Instinctual impulse belongs-as I shall show later- more to the life of feeling, and the thinker tries to keep away from this. He does this by representing it as inessential, and by concentrating his whole attention on more material experience. That part of his feeling-life which is affected by instinct, but does not disturb his principles, may them be allowed to add to his joy in life, in the form of 'normal, healthy pleasures.' Even our intuitions may appear to us as universully valid knowledge in which case thought, too, is prepared to recognize their objective value; but only on condition that it is allowed to examine and delimit their validity. Extraverted thinking does this by comparing intuitively conceived views with one another. Even their own intuition is checked up in this way by people of this type. As regards to the intuition of others, one frequently finds in them a peculiar manifestation. If, for example, in a debate, another opinion is opposed to theirs, they will regard this too with great objectivity, simply placing the two judgements side by side, and thus giving the impression that they really have no opinion of their own. In reality, they think of all judgements as facts, so as to be able to include as many as they possibly can in the thought-system they are elaborating.The mental life of people of this kind is farthest removed from feeling, since this would disturb their liking for objectivity. Their feelings are, accordingly, the least independent part of them, and are equired to fall in entirely with their principles. Feelings which will not do this remain unconscious, but may well be obvious to others. While consciously they are governed only by principles, it will, for example, be obvious in a discussion that they are personally offended, from the irritable tone of their voice, or from an involuntary hostility to opponents. In such circumstances, also, they may occasionally, in pursuit of their aims, employ means which could not well be reconciled with their principles. In general, they keep matters of feeling at a distance, particularly where love and sex are concerned."
    },
    "Extraverted Feeling (EF)": {
        "dichotomies": ["Rational", "Ethical", "Extraverted"],
        "themes": ["collectivism", "validation", "people-pleasing"],
        "brief_description": "Is fed from objective data—facts and borrowed ideas. Depends upon the facts of experience and regards the abstract idea as unsubstantial and of negligible importance. Relies on facts outside of the thinker, which are more decisive than the thinking itself, for soundness and value. Has as its goal the solution of practical problems, discovery and classification of facts, criticism, and modification of generally accepted ideas, planning of programs, and developing formulas. Dwells upon the details of the concrete case, including irrelevancies. Has a tendency to multiply facts until their meaning is smothered and thinking is paralyzed. Consists of a succession of concrete representations that set in motion not so much by an inner thought activity as by the changing stream of sense perceptions. Extraverted Feeling (EF) surveys a breadth of human emotions, values, and morals. It strives toward interpersonal rapport, consensus, and continuity. It can also be associated with effective communication and social intelligence, facilitating growth and transformation in others. Outwardly, it delivers opinions and directives in a direct yet tactful way, often with a sense of emotional urgency and conviction.",
        "detailed_description": "The extravert of feeling-type lives entirely for contacts of feeling with other people. His feeling attitudes assume a form which is generally approved in the community. As a rule, the life of the individual of feeling-type is not dominated by violent emotion or overwhelming moods: at the same time, in this particular type it is the influence of less differentiated kinds of feeling which tends to find expression. All the actions, thoughts, and observations of people of this type are, however, governed by the effort to establish relationships of feeling with other people. In this, feeling constantly seeks expression, and tries accordingly to arouse corresponding feelings in others, sometimes by means of almost imperceptible manifestations on their own part. The fine shading of their own emotional life enables them, moreover, to read the feelings of others from the smallest indications. In this case, their insight is not always consciously employed, but is more likely to be revealed in an adjustment of their own reactions to such feelings on the part of other people. As a result of this swift understanding of the attitudes of others, and of the immediate adjustment of their own reaction, extraverted feeling is extraordinarily valuable in social intercourse.Human relationships form in the element in which the individual of feeling-type is most at home. He knows exactly how things ought to be among the people among whom he has grown up. As an extravert, he derives his sense of security from the forms of current in the external world. In his experience, feeling attitudes are things of objective value, and he finds support for this conception in the fact that others also possess these feelings, and that the life of the community is itself based on them. In such people there is a vital need to find corresponding feelings in others. They are exceedingly unhappy when out of touch with their environment, and must always seek to re-establish contact. If they meet with no sympathy, they will prefer strife to indifference, and since in this case also they know how to get at the feelings of others, they may be extremely unpleasant and harsh to those whom, as opponents and disturbers of their harmony, they would like to get rid of. They are first-class members of a community, seeking for themselves modes of life which others will approve. People and things to which their feelings are attached are particularly esteemed by them, such objects being singled out from the rest of the world. In their judgment of others this may easily lead to exaggeration, their tendency to idealization making them ready to overlook faults. For a woman of this type her husband is an exceptional being, and her children are regarded in the same way. This characteristic is likely to be found to some extent in everyone, where feeling is in question, but nowhere is it so marked as in people of feeling-type, because with them all relationships are conceived in somewhat ideal form. This means that anything which fits in with their feeling-life is strongly emphasized, and anything which does not do so is ignored. As a result, repression has much greater influence in these people than in representatives of any other type. Everything is repudiated, both in the loved one and in themselves, which might disturb the harmony which is necessary in to them. If, as a result, they manage to conceal from themselves certain marked characteristics, it may happen that even so these are to some extent apparent, and this gives an impression of something artificial in their harmony, and something a bit unreal in their idealism.In children of this type, it is often possible to observe these traits at quite an early age. They are more taken up with their parents, or with others who attract them, than are other children. They idealize their parents, for instance, to a marked degree, and refuse to hear anything against them. They also try to live up to an ideal themselves. They like to be praised, and show a certain over-sensitivity if others do not meet them in this. They have a great need for love, and wan constant demonstrations from older people of their affection for them. At the same time, they very soon find out the soft spots in the feelings of the persons in their environment. While extraverted intuitive children want, as a general rule, to make an impression, with young people of this feeling-type this is more a means to establishing emotional contacts with others. Probably most children long to be their mother’s or father’s favourite, but nowhere is this felt to be such a vital question as with children of this type. They are apt, in their enthusiasm, to see in their ideal a combination of all that they value, and to fall into profound despair when they are unsuccessful in establishing the relationship that they desire. At a later age, also, the happiness of these people usually depends on some feeling-relationship with another person, or with several others. This type is particularly found among women, and family life certainly offers a woman opportunities of developing the happiest side of feeling. In the daily life of a woman of this type, the striking thing is not so much an intense expression of feeling as the remarkably appropriate and fine shading of this expression. Such a woman will never do or say anything to disturb the harmony of her environment, but, on the contrary, will create and reinforce it in all kinds of small ways. But, as a rule, she is also well able to wound if she feels so inclined. If harmony is not attained, she feels it much more than would others, and her life may appear to be quite broken up as a result. Where idealization is remote from reality, exaggerated expectations are often followed by great disappointment, and the individual of feeling-type will take this terribly to heart, so that it fills his whole horizon. “Himmelhoch jauchzend, zum Tode betrubt” (“Rejoicing to heaven, grieved unto death”) is a particularly appropriate description of the state of mind of this type of person.When anything happens which touches on feeling, an individual of this kind finds it impossible to be a simple onlooker: he helps to create the atmosphere by the way in which he gives himself up to every impression. Extraverts of this type often possess a peculiar gift, amounting to genius, for giving expression to what everyone is feeling at the time, for they are able to express the most varied shades of any feeling in such a plastic way that they readily arouse response in others. Hence there are found among the representatives of this type many famous preachers and priests, great orators, and gifted actors and actresses. Even in their outward appearance expresses the attitude of feeling which is most prevalent with them. This is true not only of the well-bred woman or girl, or of the clergy, but just as much of the demi-mondaine or of the gentleman come down in the world who may belong to the type.…An individual of this type really only sees himself and his own life as reflected in his relationships with other people and in their opinions of himself. Hence he is very susceptible to praise and criticism. Encouragement will very quickly intensify and extend a reaction of feeling, while a comment or an objection which cannot be refuted may exert an exceedingly depressing influence on his spirits. Especially where some uncertainty might exist in regard to agreement between his own views and those generally current does he feel it absolutely necessary to prove to the world that his own feelings are right. While under the influence of powerful feelings, such people are able to exert great influence in their environment, particularly if they find support for their feelings in followers and onlookers. With most people of this type, however, feelings are expressed less in impressive actions than in the creation of a harmonious atmosphere. In their relationship with those around them they do their best to insist on friendliness and fair play, and they are usually conscientious and orderly even in small matters. Since they make similar demands on others, they frequently come into conflict with others, who do not always see the same necessity. Their punctiliousness may degenerate into pettiness, and occasionally such people may become very tiresome and persnickety about details. They will “go on” endlessly about something they feel to be wrong, and since they attach universal validity to the judgments of their feeling, they cannot stop trying to convince others. As a result, they may be tiring to those around them, in spite of their kindness and friendliness. In their persistence we see again the significance of will for this type. They may give themselves up with extraordinary self sacrifice and devotion to those whom they love, and to the purpose to which they have set themselves.…There is no independence in the rational judgment of persons of feeling-type. It is not always easy to recognize this, because they often make good use of their reason: and, moreover, they are quite unaware themselves that in thinking they pick and choose entirely according to what fits in with their sentiments. It is usually not easy to make them see that the objectivity and criticism of thought is something quite different from moral judgment. In practical matters they can generally make good use of reason to work out and defend what they consider to be right, but they admit only those arguments which accord with their feeling-attitude. This is probably the case with most people in questions of feeling; but nowhere is this effect of feeling so strong, and so many-sided, as in extraverts of feeling-type. For example, even in scientific problems they will take sides in a violently personal way."
    },
    "Extraverted Sensing (ES)": {
        "dichotomies": ["Irrational", "Sensing", "Extraverted"],
        "themes": ["action", "realism", "pleasure"],
        "brief_description": "Suppresses as far as possible the subjective element of the sense impression. Values the object senses rather than the subjective impression, of which the individual may hardly be aware. Sees things photographically, the impression being one of concrete reality and nothing more. The 'primrose by a river's brim' is simply a primrose. Leads to concrete enjoyment, seizing very fully the momentary and manifest existence of things, and that only. Develops attention that is riveted by the strongest stimulus, which invariably becomes the center of interest, so that life seems wholly under the influence of accidental outer happenings. Develops a pleasure-loving outer self, very rich in undigested experience and unclassified knowledge of uninterpreted facts. Must be balanced by introverted judgement, or it makes a shallow, wholly empirical personality, with many superstitions and no morality except collective conventions and taboos. Extraverted Sensing (ES) seeks extensive outer stimulation in the “here and now”—new sights, sounds, tastes, experiences, etc. It is open-ended and non-discriminating with respect to new experiences. It can also be associated with image-consciousness and observation skills, displaying a keen eye for detail. Outwardly, it may manifest as a recurrent desire for activities beyond talking ('Lets do something!').",
        "detailed_description": "The life of the instinctive extravert is determined by impressions received from without, to which he reacts with his instinctual impulses. In children of this type it is possible to observe at a very early age that sensations are for them of particular significance, {28} and that they very quickly become at home in the world of facts and things. At the same time, they are strongly reactive. If an object catches their attention, they at once seize hold of it, or they go after it, and study it from all sides. They will, moreover, repeat this reaction again and again over a long period of time. Such a child needs to have a world of forms, colours and tones. He wants to sniff at every flower, and can with difficulty restrain his impulse to gobble up the things that tempt him. At a later age, also, facts perceived through the senses remain for people of this type the only reality. They never linger over reflections and principles; they are, to an extreme degree, realists. Nor do they feel any need to evaluate their experiences in any systematic way, but their reactions drive them from one sensation to the next. They are thus strongly influenced by their environment, but are nevertheless not entirely passive within it; for both in the manner in which they are affected, and in their reaction, there is some personal activity of their own. The purposes of this activity are usually only known to them in so far as it is a question of intentions which can be fulfilled in practice. It would also not be true to say that instinct leads exclusively to personal satisfaction of sensuous desires. For an individual is also bound by his instinctual life to the group to which he belongs, and under certain conditions it will drive him to dedicate his powers to its service, or even to sacrifice himself for it. In the case of a woman, one thinks of the instinctual aspect of her love for her children; in the case of a man, of his urge to fight on behalf of his family. This instinctive aspect in adaptation to the community is also expressed in the faithful maintenance of custom and tradition, for here lies, as in instinct, a wealth of ancestral experience. For an instinctive person it is particularly dangerous to break loose entirely from them, for they provide him with a special kind of support in the ordering of his life, owing to the fact that he understands the meaning of these traditional forms better than do individuals of other types, and indeed he can only with difficulty develop other modes.A great many so-called “ordinary” people belong to this type. If they do create any impression, it is more owing to their success in making an art out of life than to any special qualities. They feel at home in the world, accept things as they are, and know how to adjust themselves to circumstances. Since their acceptance of things as they are extends to themselves, they are occasionally a little too easy-going towards their own faults; but, on the other hand, they do not readily overvalue themselves. They have, in fact, a tendency to expect too little of themselves, since they are {29} very little aware of their aims and possibilities. They are most impressed by facts, and their originality finds expression in a truer and less prejudiced view of these than others take, with the result that they may also discover fresh facts. The phrase “matter-of fact” describes this attitude very clearly. They fight somewhat shy of ideals. They stick to experience, are empiricists par excellence, and are in general conservative in their practical life, if they see no prospect of advantage in change. They are pleasant people, good comrades, and jolly boon-companions. They often make good observers, and they make good practical use of their observations. They are frequently good story-tellers. They are most suited to practical callings, such as those of doctor or engineer. Their fondness for knowing a multitude of facts is related to a preference which they occasionally show for collecting objects of scientific or aesthetic interest. One may also include in this type many people of good taste, who have developed appreciation of the subtler pleasures of life into a fine art. Such people are often well able to discuss problems and theories of life, but in this case it is more for the pleasure of the discussion than out of interest in the actual problems. For the sake of some special sensation, they will take up all kinds of things which otherwise would not interest them. For people of this type are not satisfied with a simple pursuit of instinctual gratification. They seek intense and unusual sensations, and by no means only those which are pleasant and easily attained.Here, as with the other types, there may exist great variety within the bounds of the type. But the ideals of such people are directed almost exclusively towards the external side of life. They are well dressed, live in comfortably appointed houses, eat and drink well, have pleasant manners, and a reasonable variety in their conversation and mode of life. They take pleasure in the possession of a house and garden, and in looking after them; their usual preference is for natural pleasures such as physical exercise and sport. In uncomplicated people of this type, the inner life plays practically no part. Anything emanating from this side of life, which might disturb the happiness of their life, is rejected as morbid. Feelings and thoughts are identified with emotions and perceptions. Their activity is primarily reactive. They will do no more than is necessary to procure those sensations which offer them pleasure, and this will mean much or little, according to circumstances.More complicated forms of this type occur where a second function is developed up to a certain point. Where reason is developed, it will, in these people, be affected by the predominating function, i.e. in this case by outwardly directed instinct. The result {30} is that reason is directed chiefly to facts, and limited to the empirical. It accepts, for its classification of facts, the thought-systems in current use. Thought is thus unoriginal and avoids any complexity, but is solid and practical. In simple, practical matters, judgment is accurate and very reliable.Feeling may also exert some influence within the limits set by the type. In this case the sensual aspect of feeling is reinforced by instinctual activity, while the result of extraversion is a dependence on sensation. As a result, feeling is to a high degree controlled by the external appearance of the object, and demands expression in tangible form. Concrete facts, such as the presence and possession of the object, play a large part here. Anyone who is absent for a long time will, for example, find it difficult to arouse strong feelings in a representative of this type. Their feelings embrace the sphere of their lives as a whole. An instinctive person will love his wife, for example, not because of his personal contact with her, but primarily because she is his wife, and the mother of his children. Similar feelings are also aroused in him by the house which he has known from childhood, and by the objects which it contains, by the people of his home town and by his native soil. In their love-relationships sex plays a large part with these people; in fact, any feeling can with them attain satisfactory development, only if it can be expressed in the ordinary affairs of daily life.Intuition is the least effective function in the instinctive individual, for, with its spontaneous, unfounded convictions, it is far removed from the instinctual mode of orientation, proceeding, as this does, empirically and step by step. These people find it impossible to understand how anyone could attach value to inspiration, but they can appreciate intuitions in the form of wit or jokes, both in themselves and in others. The things that can only be grasped intuitively, however, such as the vast order of the universe, and a realization of their own potentialities and of the meaning of their lives, may easily pass them by. They are not only suspicious of any complexity, but find it difficult to perceive possibilities in the way of action and development, unless chance circumstances lead them right into them."
    },
    "Extraverted Intuition (EN)": {
        "dichotomies": ["Irrational", "Intuitive", "Extraverted"],
        "themes": ["potential", "theory", "connections"],
        "brief_description": "Uses the inner understanding in the interests of the objective situation. Regards the immediate situation as a prison from which escape is urgently necessary and aims to escape by means of some sweeping change in the objective situation. Is wholly directed upon outer objects, searching for emerging possibilities, and will sacrifice all else for such possibilities when found. May be artistic, scientific, mechanical, inventive, industrial, commercial, social, political, or adventurous. Finds self-expression natural and easy. Finds its greatest value in the promotion and initiation of new enterprises. Requires the development of balancing judgement not only for the criticism and evaluation of the intuitive enthusiasms but also to hold it to the completion of its various activities. Extraverted Intuition (EN) surveys and creatively recombines a breadth of ideas, associations, patterns, and possibilities. It is characteristically innovative, divergent, open-ended, and non-discriminating. Outwardly, Ne users may present as scattered, random, quirky, witty, and ideationally curious.",
        "detailed_description": "The vision of the extraverted intuitive individual is directed chiefly on to relationships and circumstances in the external world, which are suddenly seen in a certain context, without his being able to work out how he came to it. This knowledge, and the spontaneous activities in which it is expressed, often prove to be absolutely correct and to the point, when checked by later experience. The extraverted intuitive is also readily able to grasp the views of others. Whereas outwardly directed sensation submits to the guidance of material facts, intuition sees in the external world all manner of connections in an original and personal way, and is charged, as it were, with a mission to realize certain possibilities. These relate particularly to personal development and activity, both for the self and for others, and intuition seeks them everywhere, and has a special flair for finding them. Even in cases in which intuition is not the most important function, it will often provide a solution in circumstances in which none of the other functions can find a way out. Jung writes: “If intuition be the leading function, all ordinary conditions of life seem to be enclosures to which intuition must find a key. It is forever seeking new paths and new possibilities for outward life. For an intuitive person all circumstances soon become a prison, an oppression, and they long for liberation. Things in the outside world seem temporarily to have an exaggerated value, namely, when they can be of use for a solution, or a liberation, or for the discovery of a new possibility. They have, however, scarcely served as steps, or a bridge, when they seem no longer of any value and are cast off as unnecessary ballast. A fact is only valued so long as it opens up new and more important prospects, which in their turn will liberate the individual. Sudden possibilities become compelling motives which the intuitive mind cannot disregard, and for which it may sacrifice everything else.”The extraverted intuitive is in many respects the opposite of the introverted instinctive person. Whereas in the latter great passivity and a certain dependence on the environment is found, the extraverted intuitive manifests much spontaneous activity and independence, even to the point of rebelling against any obligation. This may be evident at a very early age. Children of this type are merry and full of the joy of life; but often extremely tiresome. They are always thinking out something fresh, and their imagination continually suggests fresh possibilities. They have a finger in every pie, want to know everything, and at an early age seek to become persons of some influence in their environment. They like to impress others by startling remarks or behaviour, and at an early age want to be something special. Later, also, one finds among these intuitives particularly lively people, active in mind, and expressing themselves with freedom. When they are at the top of their form, there is something radiant and inspiring about them. They are able then to entertain a whole company, and have the art of bringing other people out of themselves. They are fond, also, of making use of this capacity and of being the centre of enthusiasm. They prefer to radiate enthusiasm and to stimulate others, rather than to work something out, or enter on any lasting relationship with anyone. Novelty attracts them, both in people and in things, which makes them extremely changeable. They are often pleasanter with strangers than they are in the home circle. They constantly reveal new facets of their nature, which seem to come to light spontaneously. This was eloquently expressed in the dream of a very intuitive patient. He saw in this dream a large postal delivery van which had met with an accident, and heard the people standing round express their indignation about the reckless driving. It was at the time when these vans had just been introduced. He defended the driver, saying that these chauffeurs had constantly to drive fresh cars, and thus never got to know them properly. Analysis showed that this really represented an excuse for mistakes caused by his own recklessness. He had great difficulty in managing himself, owing to the constant irruption of fresh inspirations and impulses.Owing to this excessive spontaneity in their nature, extraverted intuitives find it extremely difficult to bind themselves to keep rules or appointments. They cannot always be depended on. Their activity is often very great, but somewhat incalculable. Their whole energy will be concentrated, almost apart from their will, on the opportunity offering at the moment. They like, however, to see quick results, and falling this, their attention is readily distracted {44} to something else. They show more impulsive energy than concentrated will-power. They are stimulated by difficulties, for they are by nature combative. They do not like to admit that they cannot do a thing, and they will discover fresh possibilities where others have failed to get on. Many discoverers and inventors belong to this type, but also the business man, who with great assurance sees new possibilities for extending his business; many lawyers, also, and politicians, even artists who manage to find new modes of expression, possess this mental structure. Among them are found leaders in many fields. In women of this type, intuition plays a part particularly in the establishment of personal relationships and in social contacts. This type of woman is peculiarly successful in initiating and organizing social activities. The pride of these people is that they see possibilities of putting something through which others regard as impossible. They are frequently better at taking the initiative in starting something than at working it out to a finish, while others will be able to profit by their idea.With intuitive people judgment takes the form of a strong, momentary conviction, which they often express so persuasively that others are influenced by it. Sometimes it is possible to confirm this conviction logically, but not always; and even without such confirmation, such a judgment will for most intuitives be binding. Where the intuitive function is highly developed, it will often be found to be astonishingly correct. But even in such a case, an intuitive may nevertheless be profoundly mistaken, and in the absence of any capacity for rational self-criticism such mistakes will also be made with complete conviction. If he notices his mistake, he is usually very adroit in correcting it or covering it up. For these people are really startlingly clever; they give an impression of making nothing of the difficulties with which others have to struggle; they can get away with anything.Reason is in intuitive people subordinate to spontaneous inspiration. It is often well developed, but is nevertheless influenced by qualities peculiar to intuition. One of the results of this is a great liveliness and flexibility in reasoning power, and a striving after originality. People of this type are able to converse in a lively way concerning all kinds of problems, and soon come to be regarded in their circle as authorities in any field. Their views often appear original, but they are frequently taken over from other people and cleverly made use of. At the same time they are apt to be ill-considered, and are seldom, if at all, elaborated into useful ideas. Thought is for these people nothing but a means to attain some {45} effect; it is never an end in itself, as with the intellectual person who seeks in it some foundation for his life. At school, children of this type are the despair of the teacher, because while they show clear evidence of good reasoning powers, it is difficult to persuade them to make use of them and to develop them, unless they can see some immediate advantage from so doing. If they have promised themselves to fulfil some purpose, or if their competitive interest has been aroused, they may occasionally distinguish themselves in the intellectual sphere; but in thought itself they find only moderate gratification. Many intellectual perceptions seem to come to them, as it were, unbidden; but if this does not happen, they generally fight shy of the trouble which it will cost them to master anything. Hence there is often something fragmentary about their knowledge. They will let contradictions stand side by side unresolved without being troubled by them, and in their theorizing they are apt to be very inconsistent. Their knowledge is not regulated by any objective system, but develops in line with their personal experiences and needs. Thus a certain ego-centricity will be evident. Since they must always allow some scope for inspiration, they will never tie themselves up too closely with formulations and rules. Room must be left for further possibilities. This occasionally gives an impression of insincerity, and may indeed lead to it. But if this characteristic is kept under control, it will imply a wide understanding, and receptivity to the views of others. This quality enables them to contribute a great deal in scientific and practical problems towards the examination of new points of view, and to bringing people of various kinds together. The special qualities in the thinking of such an individual are well illustrated by Count Keyserling.Feeling, like reason, may play a large or a small part in the lives of intuitives, but it also will be under the influence of their peculiar spontaneity. Here, also, there will be found great liveliness and flexibility in the feelings, which are very individual in their mode of expression. Many clever people belong to this type, and the majority of artists. There is a lively expression of feeling, but it does not last long, the intuitive person being more concerned with expressing himself, and making a strong momentary impression on others, than with the formation of a lasting relationship. To this type, also, belong those people who carry on entire conversations without paying the slightest attention to the replies or remarks of the other person. When they do want to stimulate some response, it is usually with some special intention, and not because they want a closer personal contact. They shrink from intimate relationships, owing to a fear of limiting thereby their freedom to act in accordance with {46} their intuitions. As a rule, they are on friendly terms with a large number of people, and have a wide circle of acquaintances, but no really intimate friends of either sex. Their surface of contact with others is limited, but intense, and at the same time mobile. This mobility makes it appear wider than it is, while hindering any more intimate tie. It is a characteristic which enables them to evade with considerable skill conflicts both within themselves and with others. A joke or a compliment will be made to distract attention from any difficulty or contradiction. The consequences of feeling will always be avoided, if in any way possible. As a result, there is at times with people of this type a tendency to play with feelings: they prefer them in the form of fireworks, rather than as aflame. If they should be caught up in them, it is usually to some extent against their will.The result of this attitude is the same as where thinking is concerned, a marked ego-centricity in the emotional life. Feeling is not for them a sphere of influence, whose laws they accept, but a playground for their own personal opportunities, and the ego is the determining factor. The weak point in the emotional life of the extraverted intuitive is his vanity. His enthusiasm is usually only aroused by something in which he himself can play an important part. He is thrilled by other people only when they have some value for his personal life, or, more especially, when they appreciate something in him. If his vanity is wounded, he will generally not let it be seen at once. He will answer to a criticism only if directly challenged; otherwise he will prefer to keep out of the way of the critic, or himself will assume a very critical attitude. Here the effect of vanity is in contradiction to that chivalrous generosity which in other circumstances bids him make allowances for mistakes and faults in others.This tendency to keep at a distance and to avoid conflicts, in the sphere of feeling as in the sphere of thought, is associated with a certain insecurity, concealed behind an appearance of decisiveness. These people are sometimes conscious of this sense of insecurity, but sometimes not. Its source lies in the dependence of intuitive people on images. Adaptation, based on clearly perceived images, seems to them to be safer and more exact than other modes of orientation based more on trial and error; but this is only so long as these images and the connections they express are not questioned. When this happens, the suspicion dawns on them that these images are not the facts themselves, and that things may possibly be other than they appear. The customary assurance of the intuitive individual then forsakes him, and he will be apt to try and escape both facts and arguments based on reason or feeling. {47} The aspect of life which the intuitive finds it most difficult to accept is that which is most congenial to the instinctive individual. The facts of the external world, and physical and instinctual needs, are likely to be the greatest hindrance to anyone whose constant aim it is to realize fresh possibilities. This is particularly true of the compelling aspect of his instinctual needs; such people often show a compulsive tendency to deny their own bodily and instinctual needs, even to an extreme degree. When consumed with zeal for their work, they will, for example, easily forget to eat or sleep until exhaustion overcomes them. As a rule, too, they take no trouble in the reasonable ordering of their sexual life, with the result that their sexual impulses take them unawares. They find the instinctive side of life somewhat disturbing, and prefer to ignore it."
    },
    "Introverted Thinking (IT)": {
        "dichotomies": ["Rational", "Logical", "Introverted"],
        "themes": ["system", "hierarchy", "meaning"],
        "brief_description": "Is fed from subjective and unconscious roots—archetypes. Depends upon the abstract idea as the decisive factor, and values facts chiefly as illustrative proofs of the idea. Relies on the thinker's powers of observation and appreciation and use of the inner wealth of inherited experience for soundness and value. Has as its goal formulating questions, creating theories, opening up prospects, yielding insight, and finally, seeing how external facts fit into the framework of the idea or theory it has created. Seizes upon the similarities of the concrete case, dismissing irrelevancies. Has a tendencies to neglect facts or coerce them into agreement with the idea, selecting only those that support the idea. Consists of an inner thought activity, tied loosely if at all to the stream of sense impressions, which are dimmed by the vividness of the stream of inner impressions. Introverted Thinking (IT) utilizes deep and nuanced logic to examine techniques, problems, concepts, or theories. It seeks self-regulation and self-optimization through the development of personal skills, methods, and strategies. It takes a skeptical and reductive approach toward knowledge.",
        "detailed_description": "The introvert of thinking-type also takes his systematized experience as his guide; but here the emphasis falls on the inner aspect, thus on the need for objective order and on laws and principles, according to which experience is generally systematized. Abstraction of that part of conscious experience which is revealed as constant and subject to general rules is regarded by the introverted thinker as something of vital significance. He tries to arrange the opinions which he takes over from others in a system of his own. In doing so, he will take up a more critical attitude in regard to the thought-material which he is taught than do extraverted thinkers, and his aim is to follow the guidance of his own opinions and convictions. In consequence, we find a most careful working-over of his own experience, but a tendency to leave out of his reckoning facts and points of view which are not known to him. While the strength of the extraverted thinker lies in his easy application of systematized knowledge, the introverted thinker is particularly good at comparing systems and principles. He feels at home among abstractions, and there are many fine shades of meaning in the world of his ideas. Also, as he is more skilled in introspection, he is better able to examine mental facts than is the extraverted psychologist.Hence we see here a living contact with ideas, and subtle reflection and consideration, side by side with difficulty in expressing and applying what has been thought out, and a certain aloofness from the world of facts in general. There is thus in these people a contrast between their consciousness of the objectivity of their judgment, and their difficulty, of which they are equally conscious, in defending this judgment and securing its recognition by others. This produces, even in children of the type, a peculiar attitude. They are often reserved, somewhat timid and uncertain, and seem not to feel at home in the world. On the other hand, they will, at the same time, manifest an obstinate, somewhat pedantic decisiveness. They have not the cool logicality of the thinking extravert, but take up a more fanatical stand, which may easily degenerate into dogmatism and extreme pedantry. In general, both children and adults of this type are, as a result of their introversion, difficult to convince that they are mistaken. Their inner, logical reasoning makes them feel that they are right, and they may take up an attitude to the external world also, which might be expressed as follows: “That is my opinion, even if I can’t prove it; whether you agree or not, it will not change it to the slightest degree.”At an early age they have learned that the fact that they inwardly regard something as true does not in the least mean that others will accept it. As a result, their attitude is, in general, more skeptical in regard to the validity of any truth than is that of a thinking extravert, and they are more inclined to allow for the existence of differing views, even when these do not entirely tally with theirs or with those of prevailing authorities. At the same time, however, this gives rise to a feeling of aloofness in regard to any generally recognized system of truth, for this often seems to them something quite unattainable. On the other hand, they never cease to be surprised that what seems so obvious to them should not be equally clear to others. Occasionally such people will go to great pains to express themselves as objectively and clearly as possible, but sometimes they give up the attempt and simply present their views in the form in which they arose. In the difficult language of some philosophers we find the effect of both influences â€” sometimes in strange combination. As a result of this somewhat skeptical and resigned attitude in regard to form, the judgments of introverted thinkers have often about them something cautious, cold or stiff-necked. It is as if they already reckoned on difficulty in convincing others. Jung says of this type: “Even if he goes as far as giving his thoughts to the world, he does not deal with them as a careful mother would with her children, but he exposes them as foundlings, and at the most he will be annoyed if they fail to make their way.”This inner conflict between certainty as regards conviction, and uncertainty as to how to maintain and apply this conviction in the world, intensifies thought concerning personal conflicts and problems. Hence many philosophically disposed persons belong to this type. They aim at having, at least inwardly, a foundation of pure ideals and definite principles for the ordering of their lives. Such people make, as it were, endless preparations for life; they constantly renew their efforts to perfect their equipment, so as to be equal to the fight for existence. This they do, not only in the big problems of life, but also in ordinary practical matters. They like to have a systematic view of the whole situation before entering on any new ground. In order to be able to adapt themselves, they need to have order in their life and work, and they love making programmes. When travelling, they eagerly study maps and guide-books, or they may even try to master the language of a foreign country, before ever they go there. Such people like to be able to foresee all the possible difficulties which may arise in their business or work, so as to be able to take precautions against them in good time. Occasionally this leads to the most elaborate reckoning with every important practical detail. Ford seems to me to be a good example of the potentialities in practical adaptation characteristic of the type, with his elaborate preparations down to the smallest detail coupled with a theoretical justification of all his ideas. In a mind less clear and with less insight into what is essential, this preparation may, however, lead to much fussiness and complexity, and in such cases much energy and attention is wasted in warding off imaginary dangers.These thinking people are also found more especially among the male sex. Great philosophers, such as Kant, belong to them, and also many mathematicians and psychologists. Or they may be found in all kinds of practical and applied sciences, and taking leading roles as careful organizers, legislators or contractors. On occasion, however, they are unable to get over certain unpractical traits, and will then cause difficulties with their fanatical exactitude in details, or by everlastingly insisting on their pet principles in any discussion or practical undertaking. This makes co-operation with them in any large combine somewhat difficult. Socially, also, they are somewhat surly. Their attitude to others is more or less studied, seldom absolutely spontaneous. Here again, their systematic thinking stands between them and the world. Their words are usually carefully chosen and weighed, and thus are a kind of mask. People of this type are usually aware of this; but they see no possibility of adopting any different attitude. One usually learns to know them better in a smaller circle, where they will be more spontaneous, and even cordial or original; but even so, with a tendency to be awkward as a result of over-sensitiveness or irascibility. It is more easy to see them as they really are in some sphere in which they have begun to master the technique.As among the extraverted thinkers, here, also, we may find keen concentration of will and constant activity. Since the introvert finds the motives for his aspirations more within himself, he is less dependent on external stimuli. This is counter-balanced, however, by greater susceptibility to inner difficulties, which, accordingly, may damage his working capacity. And while his independence of circumstances gives him great perseverance, even where initially no success is to be looked for, it may also happen that he will squander his best powers on something impossible from the practical point of view, without realizing this in time.If the instinctive life manages to gain some influence, it will be conducted along definite paths by a controlling reason. As a rule, introverted thought finds support in the perceptual aspect of instinctive experience, since this represents its objective aspect. This type of thinker is, however, in philosophy, natural science and psychology, more inclined than the extravert to speculate on the nature of perception and the object. In addition, he is, as an introvert, more in touch with the subjective side of instinctual life. He is more conscious of the inner struggle between instinctual drives, and here also he will seek to create order with his reason, in which case it will depend on his principles as to how he will do this. The theorizing idealist, full of his ideal of the purity of love, and despising as filthy anything remotely associated with sex, will, in the inflexibility of his system, be not far removed from those who defend licence on the principle that nature must not be denied. Both attitudes are in point of fact calculated to evade the practical complications of the problem, and to keep it, so to speak, at a distance. The introverted thinker will sometimes have a great deal to say on such subjects; but he is not, for all that, better, or more skilled, in practice.Intuition may also influence people of this type to a greater or less degree, giving them something original, which is, however, subdued, since it can only be permitted to play any part in their life after it has been carefully tested. Intuition also reveals to them the schemata and principles according to which thought may classify experience. But the immediate results of personal vision, both in regard to the internal and the external world, tend rather to be mistrusted, unless it is obvious that they will fit into the system. These results may, however, give rise to alterations and extensions in the system. Nevertheless, fine inspirations frequently remain unfruitful, owing to the ponderous way in which they are dealt with.Feeling, again, gives rise to the chief difficulties in people of this type. Anything which conforms to their principles and views is allowed; but even this cannot easily find expression, owing to deficient familiarity with current modes of expression. As a result, people of this type will often display a strict conventionality, or else a childish disregard of these modes. Inwardly, their feelings, moods and impulses cause them much more unpleasantness than they do to the extraverted thinker, the latter being less aware of them. An introverted thinker, when in love, feels awkward, uncertain and ridiculous. He will try and talk himself out of his feelings, or else make endless preparations to give expression to them, which is, naturally, scarcely conducive to spontaneity."
    },
    "Introverted Feeling (IF)": {
        "dichotomies": ["Rational", "Ethical", "Introverted"],
        "themes": ["morality", "romanticism", "individuality"],
        "brief_description": "Is determined chiefly by the subjective factor and serves as a guide to the emotional acceptance of rejection of various aspects of life. Adapts the objective situation to the individual by the simple process of excluding or ignoring the unacceptable. Depends upon abstract feeling—ideals such as love, patriotism, religion, and loyalty, and is deep and passionate rather than extensive. Finds soundness and value inside one's self from one's own inner wealth and powers of appreciation and abstraction. Has as its goal the fostering and protection of an intense inner emotional life, and, so far as possible, the outer fulfillment and realization of the inner ideal. May be too overpowering to be expressed at all, creating a false appearance of coldness to the point of indifference, and may be completely misunderstood. Has a tendency to find no objective fulfillment or realization—or outlet—for expression, and presents the danger of living upon sentiment, illusion, and self-pity. Introverted Feeling (IF) explores and refines personal tastes and feelings, contributing to a strong sense of personal uniqueness. It is self-regulating and self-controlling, working to maintain inner emotional and moral order. It may also emotionally invest in a limited number of love objects, be they persons, animals, hobbies, or causes.",
        "detailed_description": "The introvert of feeling-type finds support and guidance by shaping his own feeling-attitudes in accordance with an inner ideal. Here the activities of feeling are hidden, and from the outside there is, as a rule, little to tell us that we are dealing with a person of feeling-type. Feeling aims more especially at an inner harmony, trying to discover what under various circumstances should be the right relationships between people if life is to be beautiful and well balanced. Reality, however, reveals in most cases that this ideal is not attained, and introverted feeling is particularly vulnerable in regard to such experiences. This vulnerability — which may become as intense at that of the sensitive plant — is one of the most characteristic peculiarities of this type.Just as with the introvert of thinking-type, we find here, too, a marked contrast between inner security on the one hand, and uncertainty in external behavior on the other. But whereas with the introverted thinker this opposition gives rise to thought concerning the problems of life, with the individual of feeling-type it leads to deep feeling, and to a strange mixture of inner tenderness and passionate conviction. These people are absolutely certain as to the soundness of their ideals, but this is accompanied by a helpless feeling that it will never be possible to realize them in this world. They do not, however, reject the world, for feeling means the making of ties and is directed towards social contacts. In spite of ever-repeated collisions with the world and with other people, they can never give up their wish to love them both.They conceal their sensitiveness behind a mask, which may be childish or simple, or again conventional, remote, or it may be friendly. But behind this mask the search goes on for someone who will understand, and for a community which will embody their ideals. However disappointed they are, they still in their innermost being believe implicitly in what their feelings tell them. Even if they are not able to express it clearly in words, they are inwardly quite certain as to what accords with them and what does not. Outwardly, their feelings are not very obvious, for when these are affected, these people tend to withdraw into themselves, and if they do express anything, it will only be much later, after they have had time to work it all over within themselves.In ordinary life their mask conceals what they really are. But there is, nevertheless, something very individual about them, sometimes remarkably so, which will come to expression particularly in certain moments, in relation to certain people. This happens more especially in two situations: when they achieve real contact with another person; and when, in a state of high emotional excitement, they stand up for a threatened ideal.In the first case, a very profound relationship of mutual understanding may suddenly come into being, all the wealth of their minds being unlocked to the confidant; sometimes this contact will later be broken off just as suddenly and unexpectedly, in defence of their own vulnerability. And where his feelings are aroused, the person who appeared to be so impersonal, remote and somewhat insignificant may suddenly burst out with a personal point of view, expressed with such conviction and such force of feeling that it compels respect.Such people may also resist with extreme obstinacy anything that does not accord with their sentiments. This resistance may be justified, in so far as it is based on a motive of fine feeling; but the means used to give it emphatic expression is ill-suited to the external world, and in this respect incorrect. The consequence is that they are nearly always misunderstood, and they tend more or less to resign themselves to this situation. This contrast between a clear intention, directed towards harmony, and uncertain modes of expression, giving rise to misunderstandings, is found again and again in the lives of these people.In childhood they are gentle and dreamy, and somewhat reserved, but with occasional violent outbursts of emotion. In familiar surroundings they can be unrestrainedly gay; but more often they are likely to exhibit violent resentment if circumstances do not correspond to their feelings, and it then seems to them that harshness and indifference prevail in the world. As a result, they seem to show signs of disappointment at a very early age, and a certain distrust of life. Owing to their inability to express themselves clearly, and to bring their ideals to reality, there may arise a feeling of impotence and inferiority. They are apt to seek the fault in themselves, and may suffer much from a sense of guilt on this account. Here, also, feelings have a tendency to extend their influence, with the result that their whole being may be plunged into depths of unhappiness; but at other times a genuine emotional contact with someone will once more fill them with a quiet and enormous delight. Now they will look at the world again with new eyes, and a feeling that is almost religious will embrace both nature and man.Later, also, the happiness of these people will depend on the emotional attachments which they are able to make, though they find it less necessary than do extraverts of this type to be in immediate touch with other people. The expression of other people’s feelings in poetry and music, and the realization, through the reading of stories and biographies, of the depths of their spiritual experience, may have the effect on these people of making them feel more at home in the world. In this way, there develops in them a life of the spirit, which is carefully concealed from strangers, and which may be expressed, for instance, in a secret piety, or in poetical forms, which are revealed only with great unwillingness.This feeling-type is particularly found among women. Whereas the woman of extraverted feeling-type has it in her to create an atmosphere of harmony around herself, in the introverted woman of this type all the riches of her mind will be developed into a love which is inwardly directed towards the highest ideals of harmony. Without saying or doing much, such a woman will emanate a feeling of rest and security. It is difficult to describe an influence of this kind, expressed as it is in such indefinite forms. But on the immediate environment it may be very effective. A mother of this type may have an even greater influence on her children than the devoted and radiant mother of extraverted feeling-type. These women are often able to implant and foster something of their own ideals in their children, exercising in this way a quiet force which helps to keep a respect for moral authority alive in the world.All the modes of expression for the deeper impulses of the spirit in religion and art find great support in such people. Whether they are artists or scientists, they are still primarily attracted by problems of the emotional life. They express themselves in such occupations with great care and precision. Here again the persistence and devotion of the individual of feeling-type become evident. When they do give form to their inner feeling — in a poem, for example — they will carefully weigh every expression; at the same time, they will often neglect generally accepted social forms, which for them have no significance; or they will employ conventional and simple forms as a mask, from behind which a more genuine and finer feelingAlthough in these persons the will, under the direction of strong moral conviction, represents an important factor in the psyche, it is less evident than in the other rational types, owing to the fact that the controlling activity is directed more inwards, and will occasionally come quite unexpectedly to light. feeling is expressed more indirectly. It is most evident in the strong sense of duty characteristic of these people, and in their faithful discharge of their duties. Their activity frequently suffers as a result of moods of discouragement. When this is so, they lose themselves in pessimistic feelings, giving up their efforts to make themselves better understood, or to alter things in their environment. After a time they recover from such moods, since they tend, as a rule, to regard them as a fault in themselves.This contact with their own moral judgment represents an essential factor in the lives of feeling-introverts. They are not bound by the judgments of others — as is the feeling-extrovert — for the standard by which they judge their own behavior is an inner moral law, intuitively felt to be binding. While the extrovert of feeling-type will repress, for the sake of harmony, things both in himself and in the external world which do not accord with his ideal, the feeling-introvert will remain more aware of such conflicts. In him, however, the limiting and excluding activity of the demand for harmony may be detrimental in a different way, everything not consonant with that harmony being regarded from a negative point of view, as opposed to what is ideal and good. It is impossible for these people to see the world or themselves objectively, and their continual comparison of things with ideal requirements gives them an exaggeratedly critical point of view. Since this also applies to their own lives, there is an undermining of their own self-confidence, as well as of their confidence in the world, which may seriously affect their happiness in life. It is necessary for these people to recognize that things which do not exactly accord with their ideals may yet have a value which may be developed.In these cases, also, the instinctual life is to a very large extent subordinated to the regulating force of feeling. Since the relationship between moral conviction and instinctual impulse is here worked out more within the mind, there is less danger of pretense for the sake of the external world than with extroverts. Instinctual feelings are subordinated to the ideal. At the same time, there may be a too forcible suppression of the instinctual life, in which case it will lead not so much to a split in the emotional life as to a certain joylessness, and to the feeling that life is passing without bringing any true fulfillment. There is too often a need to associate all pleasures and joys with some moral value, and to condemn them if this higher satisfaction is not obviously found in them.Intuition is also subjected to the authority of introverted feeling. Intuitions here bear more on the inner aspect of feeling than on its expression in other people. They may give form to the laws of feeling, but in images rather than in concepts. Where intuition is developed, it is of great assistance in finding expression for introverted feeling, both in practical life and in art. Intuition may also provide a link with religious life, which, in this case, will be specially developed in its feeling-aspect: inner moral unity with God and with his fellow-man has greater significance for the man of feeling-type than ecstatic experiences or philosophical problems. The dominance of feeling is revealed in the constant search for a harmonious relation and in the weight given to views on morality, love and justice.Thought is, as a rule, not very essential in the lives of these people. They accept the thought-forms as taught to them, and make conscientious use of them; but this is not vital to them, as the judgment of feeling is. In their thought-processes, they argue from preconceived attitudes of feeling, and frequently do not embark on any logical thinking at all, leaving the realm of logic to others to deal with."
    },
    "Introverted Sensing (IS)": {
        "dichotomies": ["Irrational", "Sensing", "Introverted"],
        "themes": ["experience", "constancy", "inertness"],
        "brief_description": "Suppresses as far as possible the objective element of the sense impression. Values the subjective impression released by the object rather than the object itself, of which the individual may hardly be aware. Sees things highly colored by the subjective factor, the impression being merely suggested by the object and coming out of the unconscious in the form of some meaning or significance. Leads to ideas, through the activation of archetypes, seizing the background of the physical world rather than its surface. Develops attention that is very selective, guided wholly by the inner constellation of interests, so that it is impossible to predict what outer stimulus will catch and hold attention. Develops an extremely eccentric and individual inner self, which sees things other people do not see, and may appear very irrational. Must be balanced by extraverted judgement, or it makes a silent, inaccessible personality, wholly uncommunicative, with no conversation except conventional banalities about the weather and other collective interests. Introverted Sensing (IS) retains, consolidates, and recollects historical and autobiographical information. It attends to and draws on a concentrated body of past experiences, routines, and traditions (i.e., the “tried and true”). It forgoes the constant pursuit of new or broad experiences, finding safety and security in stability and consistency. It also surveys inner bodily sensations.",
        "detailed_description": "The instinctive introvert is ruled by his emotions and impulses. These form the subjective side of instinctual life, just as sensation represents its objective side. The attention of the introvert is not directed primarily to the source of sensation (as communicated to {31} him through his sense-organs), but to its so-called “feeling-tone”, and to his own impulses. It depends upon the extent to which he is stirred, whether a given experience will make a big impression on him, not upon the intensity of the sensation itself. This aspect of susceptibility to emotion may occasionally, under certain conditions, prevail in anyone, but here it dominates all the other functions. Inherited disposition and early experience have produced a certain susceptibility to impressions and a certain need for emotional experience, and in these cases the whole mental life is directed by these two factors. Adjustment along these lines may, under favourable circumstances, provide for such people a satisfying existence, so long as these needs are met. Since in most cases there is little external evidence of this inner satisfaction, the lives of these people may sometimes appear to others as anything but happy, arousing compassion, for which there is no real reason.Children of this type are frequently noted for a certain gentleness and receptiveness, but also for periods of timidity and monosyllabic reserve. There is something a little vague and passive about them. They are attached to people in their environment who are kind to them. They love nature, animals, beautiful things, and an environment with which they have become familiar. Anything strange or new has at first no attraction for them; but they offer little active resistance to it and soon learn to accept the good in it. They are often friendly and easy to get on with, but a little lazy and impersonal. When older, too, these people usually give an outward impression of being reserved, quiet, and somewhat passive. Only in rare cases, for example, in artists, does the distinctive and personal quality of their inner emotion come to expression. In other cases, however, their whole behavior reveals their peculiar characteristics, although it is not easy to define these.People of this type have well-developed sense-organs, but they are particularly receptive to anything having lasting value for human instinctual needs. This lends to their lives a certain solid comfort, although it may lead to somewhat ponderous caution, if instinct becomes too deeply attached to all kinds of minor details. The advantages and disadvantages of this type are well brought out in the reserved and conservative farmer, with his care for his land and his beasts, and his tendency to carry on everything, down to the smallest detail, in the same old way. The same is true of the sailor. He also shows a passive resistance to anything new, which can only be overcome by absolutely convincing experience. Other examples of this type are the naturalist, devotedly observing in minutest detail the lives of plants and animals, the lonely collector of beautiful {32} or interesting things, the worker in applied art, and the painter, who manage to express a deep experience in the presentation of ordinary things. In their own field these people are usually very much at home, having a good mastery of the technical side of their calling, but without regarding this as any special merit. They accept both what they can, and what they cannot, do, as simple facts, but they tend on the whole to under-estimate rather than to over-estimate themselves. Pretense and bluff in others may irritate them to the point of protest, which is probably connected with their own difficulty in understanding their own potentialities and worth. These people usually strike one as very quiet and somewhat passive. Except in relation to persons and things in their own immediate sphere, to which they are bound by their instinctual reactions, they show little inclination to activity; they never readily depart from their routine. If anything gets in their way, they put up a peculiarly passive resistance, although under exceptional circumstances there may be an outbreak of wrath. If their environment is not favorable, they will nevertheless try to adapt themselves to it; in such circumstances, they are inclined to regard their emotions, in so far as they differ from other people's ideas, as morbid. At the same time, they feel extraordinarily helpless and inferior. Or they may turn away from the world and give themselves up entirely to their own emotions. Where this is the case, they see any adaptation to other people as a mere pretense, and may develop remarkable skill in belittling the motives and ideals of others.The development of reason also follows the same lines here as the general attitude to life. Facts are its point of departure, and particularly certain fundamental facts, which are subjected to exact and thorough investigation. Observations and ideas are matter-of-fact and clear. There is nothing contemplative about people of this type. Moreover, they prefer to stick to the familiar, and find it difficult to adopt anything new. This is connected with their need to see things in a clear setting. If they can bring themselves to accept anything new, they tend to occupy themselves with it until it has become absolutely clear to them. Here is revealed the obstinacy of instinct, with its ever-renewed attack until it has learned to control its object. Circumstances, however, have to be favorable. In more abstract matters, they find it difficult to form an opinion of their own, and follow those authorities {33} which, by a knowledge of facts, give them the impression of being thorough. Even so, they do not feel any confidence, and are easily upset if drawn into discussion in this field, or if the value of their authorities is questioned. On the other hand, they have few prejudices, and their view of things is calm and temperate.Feeling may also make itself felt here, in which case it is, by the influence of instinct, attached to concrete objects. But the emphasis does not rest on the object, as with the extravert of this type, but on its feeling-tone, on the reactions of the subjective personality. Here there is something compulsive in the reaction. It appears as something unalterable, and the feelings which arise therefrom are also experienced as something unavoidable, and are accepted with a certain fatalism. The attitude is, “I was born that way, and I cannot change my nature”. As a result, those people and circumstances are sought out which are congenial to them, and no attempt at adaptation is made if this search is not immediately successful. Feelings are therefore specially developed within a personal sphere to which the individual is attached and which reminds him of home. Within such a sphere, these people may occasionally be able to emanate a certain warmth and cosiness around themselves, and their love is frequently concentrated on beautiful things and on animals within this sphere. If they do not succeed in creating such a personal sphere for themselves, they may become very depressed and unhappy. In the realm of sex their feelings are strongly colored by sensual manifestations, with the result that they may become deeply attached to the object of their attraction. This predominance of the sexual instinct causes sexual attraction to play a larger part in their sentimental relationships with the opposite sex than is the case with people of other types. Masculinity and femininity are accordingly strongly emphasized in the emotional life of such people.As regards intuition, it is a concept which this type of instinctive individual also finds very difficult to grasp, and he regards its activity in others with misgiving. He cannot take it seriously. At the same time, the intuitive views of leading spirits on matters, for example, of religion and politics are accepted by him, provided they appear in traditional form. The somewhat passive attitude towards life of these people then exerts an influence, in that factors of predestination and fate are likely to play a large part in their philosophy. This latter is not much affected by their personal life, since abstract vision and practical adaptation are for them two entirely different things. This lack of a comprehensive {34} vision, and their introversion, stand in the way of a satisfactory external adaptation. They are less able than the extraverts of this type to make use of helpful circumstances, and in this respect they have, as a rule, to get help from others, who, recognizing their good qualities, manage to find an environment for them where these can come to expression."
    },
    "Introverted Intuition (IN)": {
        "dichotomies": ["Irrational", "Intuitive", "Introverted"],
        "themes": ["insight", "symbolism", "isolation"],
        "brief_description": "Uses the objective situation in the interests of the inner understanding. Regards the immediate situation as a prison from which escape is urgently necessary and aims to escape through some sweeping change in the subjective understanding of the objective situation. Receives its impetus from outer objects but is never arrested by external possibilities, being occupied rather by searching out new angles for viewing and understanding life. May be creative in any field: artistic, literary, scientific, inventive, philosophical, or religious. Finds self-expression difficult. Finds its greatest value lies in the interpretation of life and the promotion of understanding. Requires the development of balancing judgment not only for the criticism and evaluation of intuitive understanding but to enable it to impart its visions to others and bring them to practical usefulness in the world. Introverted Intuition (IN) collects conscious and subconscious information, and then synthesizes it to produce convergent impressions, insights, answers, and theories. It sees deep causes, patterns, and laws underlying sense data. It is characteristically penetrating and insightful.",
        "detailed_description": "The introverted intuitive perceives connections and meaning in the internal world, and with as much spontaneity and conviction as the extraverted intuitive sees them in the external world. It is not primarily his own personal inner life that he grasps in this way, but rather inner life in general, the inner nature of things. The aim of intuition here is to perceive the ideal essence of all things—animate and inanimate, and in their inter-relations. The clearest example of the kind of thing is seen in Plato’s “ideas” which give a purer representation of the inner being of the world than does reality itself. Jung calls these mental images, supplying meaning and a standard of comparison, “archetypes”, and he regards them as a deposit of ancestral experience. Others see in them the immediate expression of a spiritual world. These questions lie outside the realm of psychology, and would lead us to that of metaphysics. Here we must confine ourselves to the statement that intuitions of this kind concerning the inner essence of things do occur in the human mind, and that for a certain type of mind, that of the introverted intuitive, they determine and control the direction and the content of life. Here, also, intuitive knowledge is felt by the person concerned as objective and as having the universal validity of truth. Here we find, in addition to the tangible reality of sensory, perception, and the conviction of instinctual impulse, another source of certainty, of great significance for humanity, for from this intuitive knowledge there arises not only religious conviction, but, in fact, all spiritual assurance. Spinoza speaks in this respect of “scientia intuitiva”. Hence there are found also among intuitive introverts great spiritual leaders, prophets, founders of religions, {48} all those people who, for the sake of some sacred inner conviction, will endure the world’s misunderstanding and contempt.It would be a mistake, however, in studying a function, to consider only its extreme potentialities, in which all that is most profound in the human mind has taken form. For this type assumes also many much less noble forms, and there is peculiar difficulty, where this inner knowledge is concerned, in finding even approximate expression for what is perceived. It is extremely important, therefore, for people of this type to attain through their education a technique of expression, as was the case with two great artists, Rembrandt and Beethoven, both of whom I include in this class. The development of this type is slower and more arduous than that of most other people. In childhood, these people have something about them as spontaneous as have the extraverts of this type; but it is, both in form and expression, more bizarre, and less intelligible, owing to the causes being less explicable from external conditions. Such children are not very amenable to influence from their environment. They may have periods of uncertainty and reserve, after which they suddenly become very determined, and if then they are opposed, they may manifest an astonishing self-will and obstinacy. As a result of the intensely spontaneous activity within, they are frequently moody, occasionally brilliant and original, then again reserved, stubborn and arrogant.In later life, also, it is a persistent characteristic of people of this type, that while on the one hand they possess great determination, on the other hand they find it very difficult to express what they want. Although they may have only a vague feeling about the way they want to go, and of the meaning of their life, they will nevertheless reject with great stubbornness anything that does not fit in with this. They fear lest external influences or circumstances should drive them in a wrong direction, and they resist on principle. In their mode of life, and in their immediate environment, they seek to regulate everything according to their own ideas, which is apt to make them tyrants within their own small circle. Rather than adapt themselves, they will limit their contact with those who do not fall in with them. The rest of the world matters, in fact, very little to them. In contradiction to this reserve, there is the genuine enthusiasm which they may suddenly display for something. If some individual, or some event, or some object, responds to this sense which they have of the meaning of their life, and reveals to them something of their deeper purposes, then they take up a {49} different attitude, and become conscious of a more intense, more profound connection in things. The highest form of this function would imply a capacity for perceiving the deeper meaning of everything. The marvellous richness of life would then be revealed. As a rule, however, this only happens at certain moments and in relation to certain persons or things. This contradiction between intimate contact and cold reserve has been very clearly described by the introverted intuitive, Buber, in his account of the “I—you” and the “I—it” relationship. This contradiction also occurs in other people, but not with the same mutual exclusion, nor with such definiteness, as in this type. Where the inner life finds expression, there will be close attachment, but side by side with this there will be a cold aloofness (Weltfremdheit). As far as material and instinctual life is concerned, these people feel exceedingly helpless, like people suddenly transplanted from another planet. They feel much more at home in spiritual things. In the realm of the spirit they have far greater assurance than other people. Here they are stimulating; one feels that something peculiar to themselves is operative within them. But its activity often remains indefinite, owing to an inability to find adequate expression for the tension of what they mean. The spiritual side of life can only be approached through symbols; its import can only be understood in mental images, and it is by no means always possible to find this approach. Moreover, a great deal of confusion arises, because it is not understood that this is, in any case, only an approximation. Certainty in regard to the underlying intent is then transferred to the form in which it is; expressed, as a result of which formulations become dogmatic and judgment rigid. Incidental and inadequate points in the formulation are then regarded as essential and absolute. The firm conviction of these people may in such cases arouse strong opposition or find blind support. They often lay down the law in regard to what they have perceived, without its even occurring to them that it might be possible to find incorrect as well as correct elements therein. This often makes their influence over others the more effective, but it may prepare the way for great confusion. One is reminded of the influence which a man like Nietzsche has had on our generation.In the realm of thought we shall to some extent find the same characteristics as we found when extraverted intuition influences reason. Here also the influence of reason is very variable and ego-centric, and knowledge fragmentary. Ideas must come of themselves, and great effort is required if this does not happen. {50} Thought is, however, less flexible than with the extravert of this type, but frequently even more original. Many new ideas, especially in the spiritual realm, have originated with people of this type; but they are often not worked out systematically. Their thought remains aphoristic, and is often expressed in paradoxes. Men like Emerson, Shaw and Chesterton belong to this type. Side by side with ideas expressive of genius, they will occasionally propound with equal conviction mistaken and fantastic views, which they maintain with obstinacy in the face of all criticism. Intuitive conviction stands for more than rational argument, which renders such people occasionally extremely conceited and opinionated.Where it is a question of feeling with people of this type, it also assumes the peculiar characteristics of intuition. As has already been said, this gives rise to a contact with other people which is changeable and peculiar, according to whether something important is felt to lie in it, or not. As a result, emotional contacts are extremely inconstant; these people are at one moment full of enthusiasm and devotion, at the next utterly cold and stand-offish. It is always necessary, when with them, to be on the look-out for which way the wind is blowing. Spontaneous insight, and the images associated therewith, affect the feelings of the introverted intuitive in a somewhat different way from what we have seen in the case of the extravert of this type. With these extraverts the danger is that feelings are for show, with no development of inner reality. A living relationship with other people and with personal standards is lacking when this is so. With the introverted intuitive, the image of what the feelings should be may easily be substituted for a feeling-relationship. He will then make demands on others, without being prepared to meet the same demands on himself. Egotism, and a desire to dominate, may then make use of these requirements of an ideal relationship, for their own ends. Another peculiarity which may be manifested by feeling, when influenced by introverted intuition, is intense ambivalence, the co-existence of two absolutely opposed emotional attitudes. We have already seen in extraverted intuition how spontaneity favours the loose juxtaposition of opposing manifestations. In the introvert there is less variety in the form assumed by these contradictions, but great inner tension. The introverted intuitive may identify himself alternately with the divine and with the diabolical within himself. Occasionally he is unaware of this himself; when it becomes too intense, however, he feels as if he were being torn in two by conflicting forces within. In this struggle the individual concerned may be thrown hither and thither between the extremes of godlike assurance and diabolical {51} confusion. In extreme cases the result may be a character like Rasputin.As with extraverted intuition, here, also, contact is least with the facts of the external world, and with instinctual life. Such people live, as it were, alongside their bodies, until these by some disturbance demand their attention. The main thing is, however, that ordinary practical things and the world of facts are far removed for them, and they try to confine their contact with them to that which they can regulate according to their wishes. Everything else appears to them as something disquietingly incalculable, against which they must defend themselves as far as they possibly can."
    }
}