{
    "Extraverted Thinking (ET)": {
        "dichotomies": ["Rational", "Logical", "Extraverted"],
        "description": "Is fed from objective data—facts and borrowed ideas. Depends upon the facts of experience and regards the abstract idea as unsubstantial and of negligible importance. Relies on facts outside of the thinker, which are more decisive than the thinking itself, for soundness and value. Has as its goal the solution of practical problems, discovery and classification of facts, criticism, and modification of generally accepted ideas, planning of programs, and developing formulas. Dwells upon the details of the concrete case, including irrelevancies. Has a tendency to multiply facts until their meaning is smothered and thinking is paralyzed. Consists of a succession of concrete representations that set in motion not so much by an inner thought activity as by the changing stream of sense perceptions. Extraverted Thinking (ET) uses explicit logic, including standardized methods, measurements, policies, and procedures, to make systems and operations more rational, efficient, or effective. This often involves working as part of an institution, be it corporate, scientific, academic, etc. Outwardly, Te delivers opinions and directives in a firm, direct, measured, and unemotional fashion. It may at times be perceived as harsh, tactless, or unsympathetic."
    },
    "Extraverted Feeling (EF)": {
        "dichotomies": ["Rational", "Ethical", "Extraverted"],
        "description": "Is fed from objective data—facts and borrowed ideas. Depends upon the facts of experience and regards the abstract idea as unsubstantial and of negligible importance. Relies on facts outside of the thinker, which are more decisive than the thinking itself, for soundness and value. Has as its goal the solution of practical problems, discovery and classification of facts, criticism, and modification of generally accepted ideas, planning of programs, and developing formulas. Dwells upon the details of the concrete case, including irrelevancies. Has a tendency to multiply facts until their meaning is smothered and thinking is paralyzed. Consists of a succession of concrete representations that set in motion not so much by an inner thought activity as by the changing stream of sense perceptions. Extraverted Feeling (EF) surveys a breadth of human emotions, values, and morals. It strives toward interpersonal rapport, consensus, and continuity. It can also be associated with effective communication and social intelligence, facilitating growth and transformation in others. Outwardly, it delivers opinions and directives in a direct yet tactful way, often with a sense of emotional urgency and conviction."
    },
    "Extraverted Sensing (ES)": {
        "dichotomies": ["Irrational", "Sensing", "Extraverted"],
        "description": "Suppresses as far as possible the subjective element of the sense impression. Values the object senses rather than the subjective impression, of which the individual may hardly be aware. Sees things photographically, the impression being one of concrete reality and nothing more. The 'primrose by a river's brim' is simply a primrose. Leads to concrete enjoyment, seizing very fully the momentary and manifest existence of things, and that only. Develops attention that is riveted by the strongest stimulus, which invariably becomes the center of interest, so that life seems wholly under the influence of accidental outer happenings. Develops a pleasure-loving outer self, very rich in undigested experience and unclassified knowledge of uninterpreted facts. Must be balanced by introverted judgement, or it makes a shallow, wholly empirical personality, with many superstitions and no morality except collective conventions and taboos. Extraverted Sensing (ES) seeks extensive outer stimulation in the “here and now”—new sights, sounds, tastes, experiences, etc. It is open-ended and non-discriminating with respect to new experiences. It can also be associated with image-consciousness and observation skills, displaying a keen eye for detail. Outwardly, it may manifest as a recurrent desire for activities beyond talking ('Lets do something!')."
    },
    "Extraverted Intuition (EN)": {
        "dichotomies": ["Irrational", "Intuitive", "Extraverted"],
        "description": "Uses the inner understanding in the interests of the objective situation. Regards the immediate situation as a prison from which escape is urgently necessary and aims to escape by means of some sweeping change in the objective situation. Is wholly directed upon outer objects, searching for emerging possibilities, and will sacrifice all else for such possibilities when found. May be artistic, scientific, mechanical, inventive, industrial, commercial, social, political, or adventurous. Finds self-expression natural and easy. Finds its greatest value in the promotion and initiation of new enterprises. Requires the development of balancing judgement not only for the criticism and evaluation of the intuitive enthusiasms but also to hold it to the completion of its various activities. Extraverted Intuition (EN) surveys and creatively recombines a breadth of ideas, associations, patterns, and possibilities. It is characteristically innovative, divergent, open-ended, and non-discriminating. Outwardly, Ne users may present as scattered, random, quirky, witty, and ideationally curious."
    },
    "Introverted Thinking (IT)": {
        "dichotomies": ["Rational", "Logical", "Introverted"],
        "description": "Is fed from subjective and unconscious roots—archetypes. Depends upon the abstract idea as the decisive factor, and values facts chiefly as illustrative proofs of the idea. Relies on the thinker's powers of observation and appreciation and use of the inner wealth of inherited experience for soundness and value. Has as its goal formulating questions, creating theories, opening up prospects, yielding insight, and finally, seeing how external facts fit into the framework of the idea or theory it has created. Seizes upon the similarities of the concrete case, dismissing irrelevancies. Has a tendencies to neglect facts or coerce them into agreement with the idea, selecting only those that support the idea. Consists of an inner thought activity, tied loosely if at all to the stream of sense impressions, which are dimmed by the vividness of the stream of inner impressions. Introverted Thinking (IT) utilizes deep and nuanced logic to examine techniques, problems, concepts, or theories. It seeks self-regulation and self-optimization through the development of personal skills, methods, and strategies. It takes a skeptical and reductive approach toward knowledge."
    },
    "Introverted Feeling (IF)": {
        "dichotomies": ["Rational", "Ethical", "Introverted"],
        "description": "Is determined chiefly by the subjective factor and serves as a guide to the emotional acceptance of rejection of various aspects of life. Adapts the objective situation to the individual by the simple process of excluding or ignoring the unacceptable. Depends upon abstract feeling—ideals such as love, patriotism, religion, and loyalty, and is deep and passionate rather than extensive. Finds soundness and value inside one's self from one's own inner wealth and powers of appreciation and abstraction. Has as its goal the fostering and protection of an intense inner emotional life, and, so far as possible, the outer fulfillment and realization of the inner ideal. May be too overpowering to be expressed at all, creating a false appearance of coldness to the point of indifference, and may be completely misunderstood. Has a tendency to find no objective fulfillment or realization—or outlet—for expression, and presents the danger of living upon sentiment, illusion, and self-pity. Introverted Feeling (IF) explores and refines personal tastes and feelings, contributing to a strong sense of personal uniqueness. It is self-regulating and self-controlling, working to maintain inner emotional and moral order. It may also emotionally invest in a limited number of love objects, be they persons, animals, hobbies, or causes."
    },
    "Introverted Sensing (IS)": {
        "dichotomies": ["Irrational", "Sensing", "Introverted"],
        "description": "Suppresses as far as possible the objective element of the sense impression. Values the subjective impression released by the object rather than the object itself, of which the individual may hardly be aware. Sees things highly colored by the subjective factor, the impression being merely suggested by the object and coming out of the unconscious in the form of some meaning or significance. Leads to ideas, through the activation of archetypes, seizing the background of the physical world rather than its surface. Develops attention that is very selective, guided wholly by the inner constellation of interests, so that it is impossible to predict what outer stimulus will catch and hold attention. Develops an extremely eccentric and individual inner self, which sees things other people do not see, and may appear very irrational. Must be balanced by extraverted judgement, or it makes a silent, inaccessible personality, wholly uncommunicative, with no conversation except conventional banalities about the weather and other collective interests. Introverted Sensing (IS) retains, consolidates, and recollects historical and autobiographical information. It attends to and draws on a concentrated body of past experiences, routines, and traditions (i.e., the “tried and true”). It forgoes the constant pursuit of new or broad experiences, finding safety and security in stability and consistency. It also surveys inner bodily sensations."
    },
    "Introverted Intuition (IN)": {
        "dichotomies": ["Irrational", "Intuitive", "Introverted"],
        "description": "Uses the objective situation in the interests of the inner understanding. Regards the immediate situation as a prison from which escape is urgently necessary and aims to escape through some sweeping change in the subjective understanding of the objective situation. Receives its impetus from outer objects but is never arrested by external possibilities, being occupied rather by searching out new angles for viewing and understanding life. May be creative in any field: artistic, literary, scientific, inventive, philosophical, or religious. Finds self-expression difficult. Finds its greatest value lies in the interpretation of life and the promotion of understanding. Requires the development of balancing judgment not only for the criticism and evaluation of intuitive understanding but to enable it to impart its visions to others and bring them to practical usefulness in the world. Introverted Intuition (IN) collects conscious and subconscious information, and then synthesizes it to produce convergent impressions, insights, answers, and theories. It sees deep causes, patterns, and laws underlying sense data. It is characteristically penetrating and insightful."
    }
}